//***************************************************************************
//
//  Author(s)...: Pashgan    http://ChipEnable.Ru
//
//  Target(s)...: любой микроконтроллер
//
//  Compiler....: IAR EWA 5.11A
//
//  Description.: драйвер 4-ех кнопочного джойстика
//
//  Data........: 25.10.09
//
//***************************************************************************
#ifndef	BUTTONS_h
#define	BUTTONS_h

#include <avr/io.h>

//порт, к которому подключены кнопки
#define PORT_BUTTON 	PORTD
#define PIN_BUTTON 	PIND
#define DDRX_BUTTON 	DDRD

//номера выводов, к которым подключены кнопки
#define DOWN 		4
#define CANCEL 		0
#define UP		3
#define ENTER 		2

//коды, которые будут записываться в буфер
#define KEY_NULL      0
#define KEY_ENTER     1
#define KEY_CANCEL    2
#define KEY_UP        3
#define KEY_DOWN      4

//сколько циклов опроса кнопка должна удерживаться
#define THRESHOLD 20
/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       инициализация портов ввода/вывода
*                   вызывается обычно в начале main`a
****************************************************************************/
void BUT_Init(void);

/**************************************************************************
*   Function name : BUT_Debrief
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       опрашивает кнопки. вызывается обычно из прерывания
*                   если кнопка нажата в течении 20 прерываний,
*                   ее номер записывается в буфер
****************************************************************************/
void BUT_Debrief(void);

/**************************************************************************
*   Function name : BUT_GetKey
*   Returns :       номер нажатой кнопки
*   Parameters :    нет
*   Purpose :       возвращает содержимое кнопочного буфера
*                   при этом буфер очищается
*                   вызывается обычно в main`e в цикле while
*
****************************************************************************/
unsigned char BUT_GetKey(void);


/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    номер кнопки
*   Purpose :       записывает в кнопочный буфер значение
*                   требуется иногда для имитации нажатия кнопок
****************************************************************************/
void BUT_SetKey(unsigned char key);

#endif //BUTTONS_H
